<html>
<head>
   <title>Introducci&oacute;n</title>
   <meta name="generator" content="Help & Manual">
   <meta name="keywords" content="">
</head>


  <!-- Redirect browser to index page if page is not in the content frame.
       This script is only valid for regular HTML export -->
  <script language="JavaScript">
       <!--
           if(top.frames.length==0) top.location.href='index.html?introducción.htm'
       //-->
  </script>


<body bgcolor="#FFFFFF">


<table width="100%" border="0" cellspacing="0" cellpadding="2" bgcolor="#C0C0C0">
  <tr>
    <td align="left">
      
<span style="font-family:Helvetica,Arial; font-size:12pt; color:#000000"><b>Introducci&#243;n
<br>
</b></span>
    </td>
    <td align="right">
     <font face="Arial" size="2">
     <a href="javaScript:parent.reDisplay('1',1,0)">Arriba</a>&nbsp;
     <a href="javaScript:parent.reDisplay('1.1',1,0)">Abajo</a>&nbsp;
     <a href="javaScript:parent.reDisplay('1.1.2',1,0)">Siguiente</a>
     </font>
    </td>
  </tr>
</table>
<br>


<span style="font-family:Calibri; font-size:12pt; color:#000000">En cualquier empresa de la actualidad se generan grandes vol&#250;menes de informaci&#243;n en los distintos sectores que la componen. Los datos operativos producidos son registrados por los diversos sistemas correspondientes al sector y ser&#225;n almacenados en distintos destinos de datos de una manera en particular. Esta heterogeneidad desborda el poder de decisi&#243;n de los l&#237;deres y gerentes, ya que no pueden alcanzar a distinguir la situaci&#243;n real de la empresa debido al volumen de informaci&#243;n y la variedad de fuentes de decisiones, logrando as&#237; nublar la visi&#243;n a futuro y la capacidad de establecer el rumbo de las futuras pol&#237;ticas empresariales.
<br>
 
<br>
La soluci&#243;n para obtener un panorama resumido que cruce y analice todas las fuentes de datos  es contar con el sistema BIC(<i>business intelligence</i><i> cliente)</i>. Este es un sistema para el soporte de decisiones, el cual constituye una herramienta fundamental para la toma de decisiones y planeamiento estrat&#233;gico en todas las empresas, convirtiendo las m&#250;ltiples fuentes de datos en informaci&#243;n simple, concisa, ordenada e invaluable.
<br>
 
<br>
BIC se monta sobre una implementaci&#243;n de una <i>datawarehouse</i> empresarial y permite el acceso a este tipo de informaci&#243;n de una manera r&#225;pida y sencilla.
<br>
 
<br>
Una vez configurado el sistema por el arquitecto, el resto de los usuarios experimentar&#225;n una interfaz f&#225;cil y amigable que les permitir&#225; r&#225;pidamente generar y ejecutar reportes con cualquier tipo de informaci&#243;n sin tener que escribir ninguna l&#237;nea de c&#243;digo y sin ning&#250;n conocimiento t&#233;cnico extra a lo que implica poder manejar un navegador.
<br>
 
<br>
Estos reportes pueden ser guardados y consultados por el resto de los usuarios y ejecutados en todo momento. Esto tambi&#233;n implica un ahorro econ&#243;mico y en tiempo ya que no es necesario de un t&#233;cnico para generar o ejecutar los reportes. Una vez configurado el sistema, este se vuelve completamente natural e intuitivo para cualquier empleado de la organizaci&#243;n.
<br>
 
<br>
BIC es un sistema <i>web</i>, por lo cual puede ser accedido desde cualquier PC con conexi&#243;n a Internet permitiendo obtener informaci&#243;n crucial en cualquier momento desde cualquier punto remoto a la empresa. Sea en oficinas del cliente, de viaje o en el hogar, se podr&#225; obtener informaci&#243;n completamente actualizada sobre las fuentes de datos que se hayan creado.
<br>
 
<br>
Es importante recalcar que la herramienta BIC tiene como objetivo poder brindarle al tomador de decisiones de cualquier corporaci&#243;n una herramienta m&#225;s con la cual poder guiar sus metas y objetivos a mediano y largo plazo
<br>
 
<br>
BIC est&#225; orientado a ejecutivos empresariales y a todas las personas en donde se focaliza la toma de decisi&#243;n de cualquier empresa, es tanto aplicable para grandes corporaciones, as&#237; como tambi&#233;n a Pymes. 
<br>
 
<br>
BIC proveer&#225; una herramienta capaz de focalizar objetivos alcanzables a la corporaci&#243;n, as&#237; como tambi&#233;n ayudar al crecimiento de cualquier Pyme conociendo las tendencias del mercado.
<br>
 
<br>
Con BIC tiene la posibilidad de:
<br>
<table width="100%" border="0" cellpadding="0" cellspacing="0"><tr valign="top"><td width="45"><span style="font-family:Calibri; font-size:12pt; color:#000000"><font face="Symbol" size="2" color="#000000">&#183;</font></span></td><td><span style="font-family:Calibri; font-size:12pt; color:#000000">Modelar Universos/DataMarts con todos sus objetos: dimensiones, hechos, m&#233;tricas, filtros, jerarqu&#237;as.
&nbsp;<br>
</span></td></tr></table><table width="100%" border="0" cellpadding="0" cellspacing="0"><tr valign="top"><td width="45"><span style="font-family:Calibri; font-size:12pt; color:#000000"><font face="Symbol" size="2" color="#000000">&#183;</font></span></td><td><span style="font-family:Calibri; font-size:12pt; color:#000000">Generaci&#243;n de reportes y gr&#225;ficos seleccionando los objetos disponibles sin necesidad de tener conocimientos de sql.
&nbsp;<br>
</span></td></tr></table><table width="100%" border="0" cellpadding="0" cellspacing="0"><tr valign="top"><td><span style="font-family:Calibri; font-size:12pt; color:#000000"></span></td><td></td></tr></table><span style="font-family:Calibri; font-size:12pt; color:#000000"><table width="100%" border="0" cellpadding="0" cellspacing="0"><tr valign="top"><td width="45"><span style="font-family:Calibri; font-size:12pt; color:#000000"><font face="Symbol" size="2" color="#000000">&#183;</font></span></span></span></td><td><span style="font-family:Calibri; font-size:12pt; color:#000000">Operadores adicionales de refinamiento: drill up y drill down
&nbsp;<br>
</span></td></tr></table><table width="100%" border="0" cellpadding="0" cellspacing="0"><tr valign="top"><td><span style="font-family:Calibri; font-size:12pt; color:#000000"></span></td><td></td></tr></table><span style="font-family:Calibri; font-size:12pt; color:#000000"><table width="100%" border="0" cellpadding="0" cellspacing="0"><tr valign="top"><td width="45"><span style="font-family:Calibri; font-size:12pt; color:#000000"><font face="Symbol" size="2" color="#000000">&#183;</font></span></span></span></td><td><span style="font-family:Calibri; font-size:12pt; color:#000000">Repositorio de reportes en el cual se podr&#225;n guardar todos los reportes que haya generado el usuario.&nbsp;&nbsp;&nbsp;
&nbsp;<br>
</span></td></tr></table><table width="100%" border="0" cellpadding="0" cellspacing="0"><tr valign="top"><td><span style="font-family:Calibri; font-size:12pt; color:#000000"></span></td><td></td></tr></table><span style="font-family:Calibri; font-size:12pt; color:#000000"><table width="100%" border="0" cellpadding="0" cellspacing="0"><tr valign="top"><td width="45"><span style="font-family:Calibri; font-size:12pt; color:#000000"><font face="Symbol" size="2" color="#000000">&#183;</font></span></span></span></td><td><span style="font-family:Calibri; font-size:12pt; color:#000000">Mejorar sustancialmente los tiempos de acceso a la informaci&#243;n
&nbsp;<br>
</span></td></tr></table><table width="100%" border="0" cellpadding="0" cellspacing="0"><tr valign="top"><td width="45"><span style="font-family:Calibri; font-size:12pt; color:#000000"><font face="Symbol" size="2" color="#000000">&#183;</font></span></td><td><span style="font-family:Calibri; font-size:12pt; color:#000000">Flexibilidad para el usuario final en los an&#225;lisis que necesita realizar, puesto que la informaci&#243;n se agrupa dimensionalmente.</span><span style="font-family:Helvetica,Arial; font-size:10pt; color:#000000">
&nbsp;<br>
</span></td></tr></table><table width="100%" border="0" cellpadding="0" cellspacing="0"><tr valign="top"><td><span style="font-family:Helvetica,Arial; font-size:10pt; color:#000000"></span></span></span></td></tr></table>

</body>
</html>
