<html>
<head>
   <title>Metricas</title>
   <meta name="generator" content="Help & Manual">
   <meta name="keywords" content="">
</head>


  <!-- Redirect browser to index page if page is not in the content frame.
       This script is only valid for regular HTML export -->
  <script language="JavaScript">
       <!--
           if(top.frames.length==0) top.location.href='index.html?metricas2.htm'
       //-->
  </script>


<body bgcolor="#FFFFFF">


<table width="100%" border="0" cellspacing="0" cellpadding="2" bgcolor="#C0C0C0">
  <tr>
    <td align="left">
      
<span style="font-family:Helvetica,Arial; font-size:12pt; color:#000000"><b>Metricas
<br>
</b></span>
    </td>
    <td align="right">
     <font face="Arial" size="2">
     <a href="javaScript:parent.reDisplay('1',1,0)">Arriba</a>&nbsp;
     <a href="javaScript:parent.reDisplay('4.7',1,0)">Abajo</a>&nbsp;
     <a href="javaScript:parent.reDisplay('4.9',1,0)">Siguiente</a>
     </font>
    </td>
  </tr>
</table>
<br>


<span style="font-family:Calibri; font-size:12pt; color:#000000">Luego de haber definido los <a href=javaScript:parent.reDisplay('4.6',1,0)>hechos</a> en BIC podemos entrar a la solapa de m&#233;tricas para crear las mismos. La pantalla que se mostrar&#225; una vez que se ingresa a esta solapa es la siguiente:
<br>

<br>
<p align="center"><img src="clip0021.jpg" width="764" height="552" border="0" alt="clip0021">
<br>
</p>
<br>
<span style="font-family:Calibri; font-size:14pt; color:#000000"><b><i><u>Agregar nuevo:
<br>
</u></i></b></span><span style="font-family:Calibri; font-size:12pt; color:#000000">Si se desea crear un nueva m&#233;trica se presiona el bot&#243;n <img src="clip0013.jpg" width="111" height="21" border="0" alt="clip0013">, el cual podemos visualizar en la figura anterior. Luego de esto se mostrar&#225; la siguiente pantalla:
<br>

<br>
<p align="center"><img src="clip0022.jpg" width="754" height="549" border="0" alt="clip0022">
<br>
</p>
<br>
A trav&#233;s de esta pantalla se puede ingresar los campos Nombre, hecho y funci&#243;n que corrresponden a la nueva m&#233;trica a crear. 
<br>
El Nombre de la m&#233;trica la elige el usuario seg&#250;n su preferencia. El sistema verificar&#225; que el nombre elegido no exista en el <a href=javaScript:parent.reDisplay('4.3',1,0)>proyecto</a> en el cual se est&#225; creando la m&#233;trica. 
<br>
El hecho es uno que se ha seleccionado anteriormente en la solapa de <a href=javaScript:parent.reDisplay('4.6',1,0)>hechos</a>.
<br>
La funci&#243;n a elegir, como se ve en la figura anterior puede ser promedio, total de registros, m&#225;ximo, minimo o sumatoria del hecho en cuesti&#243;n. Esto lo que har&#225; es aplicar esta funci&#243;n sobre el hecho que elijamos para que luego pueda verse en el <a href=javaScript:parent.reDisplay('4.9',1,0)>reporte</a>.
<br>

<br>
En el caso de que el nombre de la m&#233;trica ya exista aparecer&#225; un mensaje que diga: "No se puede crear la metrica ya que existe una con el mismo nombre."
<br>

<br>
</span><span style="font-family:Calibri; font-size:14pt; color:#000000"><b><i><u>Editar:</u></i></b></span><span style="font-family:Calibri; font-size:12pt; color:#000000">
<br>
Si se desea modificar una m&#233;trica en especial se presiona el "editar" correspondiente a la m&#233;trica a editar. Luego de esto se mostrar&#225; la siguiente pantalla:
<br>

<br>
<p align="center"><img src="clip0023.jpg" width="767" height="548" border="0" alt="clip0023">
<br>
</p>
<br>
A trav&#233;s de esta pantalla se pueden cambiar los campos Nombre, hecho y funci&#243;n que ya ten&#237;a asignado la m&#233;trica en cuesti&#243;n. Por ejemplo si le quisiera cambiar el nombre a la m&#233;trica por algo m&#225;s significativo en el campo Nombre realizar&#237;a esta acci&#243;n.
<br>
Al igual que en "agregar m&#233;trica" el sistema verificar&#225; que el nombre elegido no exista en el <a href=javaScript:parent.reDisplay('4.3',1,0)></a> en el cual se est&#225; creando la m&#233;trica. 
<br>

<br>
</span><span style="font-family:Calibri; font-size:14pt; color:#000000"><b><i><u>Borrar:</u></i></b></span><span style="font-family:Calibri; font-size:12pt; color:#000000">
<br>
Si se desea borrar una m&#233;trica en especial se presiona el "borrar" correspondiente al <a href=javaScript:parent.reDisplay('4.3',1,0)>proyecto</a> a eliminar. Una vez presionado se desplegar&#225; el siguiente mensaje:
<br>

<br>
<p align="center"><img src="clip0024.jpg" width="280" height="124" border="0" alt="clip0024">
<br>
</p>
<br>
Si presiona el bot&#243;n <img src="clip0010.jpg" width="70" height="17" border="0" alt="clip0010"> y la m&#233;trica no est&#225; siendo utilizado por ning&#250;n <a href=javaScript:parent.reDisplay('4.9',1,0)>reporte</a> se eliminar&#225; la misma del <a href=javaScript:parent.reDisplay('4.3',1,0)></a>.
<br>
En el caso que la m&#233;trica est&#233; siendo utilizado por alg&#250;n reporte en particular aparecer&#225; un mensaje que dice:
<br>
"No se puede eliminar la m&#233;trica ya que est&#225; siendo utilizado".
<br>
En caso de que se presiona el bot&#243;n <img src="clip0012.jpg" width="70" height="18" border="0" alt="clip0012"> la m&#233;trica quedar&#225; en el sistema tal cual como estaba antes de intentar eliminarlo.</span><span style="font-family:Helvetica,Arial; font-size:10pt; color:#000000">
<br>
</span></span></span>

</body>
</html>
