<html>
<head>
   <title>Reportes</title>
   <meta name="generator" content="Help & Manual">
   <meta name="keywords" content="">
</head>


  <!-- Redirect browser to index page if page is not in the content frame.
       This script is only valid for regular HTML export -->
  <script language="JavaScript">
       <!--
           if(top.frames.length==0) top.location.href='index.html?reportes.htm'
       //-->
  </script>


<body bgcolor="#FFFFFF">


<table width="100%" border="0" cellspacing="0" cellpadding="2" bgcolor="#C0C0C0">
  <tr>
    <td align="left">
      
<span style="font-family:Helvetica,Arial; font-size:12pt; color:#000000"><b>Reportes</b><span style="font-family:Helvetica,Arial; font-size:10pt; color:#000000">
<br>
</span></span></span>
    </td>
    <td align="right">
     <font face="Arial" size="2">
     <a href="javaScript:parent.reDisplay('1',1,0)">Arriba</a>&nbsp;
     <a href="javaScript:parent.reDisplay('1.1.7',1,0)">Abajo</a>&nbsp;
     <a href="javaScript:parent.reDisplay('1.2',1,0)">Siguiente</a>
     </font>
    </td>
  </tr>
</table>
<br>


<span style="font-family:Calibri; font-size:12pt; color:#000000">Para que se puedan tomar decisiones se necesita contar con informaci&#243;n confiable y oportuna. En muchas ocasiones, los responsables en proporcionar este tipo de datos no los presentan a tiempo o estos no cubren con las expectativas, por lo tanto restan eficiencia a la labor del gerente o tomador de decisiones, y por ende no pueden ser utilizados para su an&#225;lisis, evaluaci&#243;n y la creaci&#243;n de sugerencias que mejoren las operaciones del negocio.
<br>

<br>
A traves de los reportes que BIC pone a su alcance, la obtenci&#243;n de esta valiosa informaci&#243;n queda a cargo de los mismos tomadores de decisiones, es decir, de quienes la requieren y saben qu&#233; datos concretos son necesarios para la b&#250;squeda de oportunidades y la resoluci&#243;n de problemas propios del negocio.
<br>

<br>
La generaci&#243;n de reportes es el fin &#250;ltimo del sistema BIC, siendo este su m&#243;dulo m&#225;s importante.
<br>

<br>
Previamente a la definici&#243;n de reportes el arquitecto debe establecer las relaciones que existen en el modelo estrella de la base de datos, esto es: definir las <a href=javaScript:parent.reDisplay('1.1.3',1,0)></a>, <a href=javaScript:parent.reDisplay('1.1.5',1,0)>hechos</a> y <a href=javaScript:parent.reDisplay('1.1.4',1,0)></a> con sus correspondientes relaciones. Lo anteriormente dicho, le dar&#225; el marco requerido al <a href=javaScript:parent.reDisplay('3.1',1,0)>arquitecto</a> o <a href=javaScript:parent.reDisplay('3.1',1,0)></a> para la definici&#243;n de m&#233;tricas y  filtros, y la posterior obtenci&#243;n de los reportes estrat&#233;gicos. 
<br>

<br>
Por &#250;ltimo, una vez que ya hemos generado el reporte y visualizado la informaci&#243;n que nos interesa, BIC nos permite generar una serie de gr&#225;ficos, mostrando la informaci&#243;n de forma clara y concisa.
<br>
<span style="font-family:Helvetica,Arial; font-size:10pt; color:#000000">
<br>
</span></span></span>

</body>
</html>
