<html>
<head>
   <title>Visualizaci&oacute;n de reportes</title>
   <meta name="generator" content="Help & Manual">
   <meta name="keywords" content="">
</head>


  <!-- Redirect browser to index page if page is not in the content frame.
       This script is only valid for regular HTML export -->
  <script language="JavaScript">
       <!--
           if(top.frames.length==0) top.location.href='index.html?visualizacióndereportes.htm'
       //-->
  </script>


<body bgcolor="#FFFFFF">


<table width="100%" border="0" cellspacing="0" cellpadding="2" bgcolor="#C0C0C0">
  <tr>
    <td align="left">
      
<span style="font-family:Helvetica,Arial; font-size:12pt; color:#000000"><b>Visualizaci&#243;n de reportes
<br>
</b></span>
    </td>
    <td align="right">
     <font face="Arial" size="2">
     <a href="javaScript:parent.reDisplay('1',1,0)">Arriba</a>&nbsp;
     <a href="javaScript:parent.reDisplay('4.9.1',1,0)">Abajo</a>&nbsp;
     <a href="javaScript:parent.reDisplay('5',1,0)">Siguiente</a>
     </font>
    </td>
  </tr>
</table>
<br>


<span style="font-family:Calibri; font-size:12pt; color:#000000">Para visualizar los reportes previamente <a href=javaScript:parent.reDisplay('4.9.1',1,0)>configurados</a> debe ingresar en la pantalla de administraci&#243;n de reportes.
<br>
All&#237; encontrar&#225; el listado de los reportes disponibles para su ejecuci&#243;n.
<br>
Seleccionando el bot&#243;n ejecutar correspondiente al reporte que se quiere visualizar  se mostrar&#225; una tabla con el contenido del reporte.
<br>
A continuaci&#243;n se ejemplifica la ejecuci&#243;n del un reporte.
<br>

<br>
<p align="center"><img src="clip0034.jpg" width="767" height="580" border="0" alt="clip0034">
<br>
</p>Como podemos observar en la parte central de la pantalla se encuentran los datos obtenidos de acuerdo a la especificaci&#243;n definida.
<br>
En la parte superior izquierda podemos ver los combos de drill down y drill up:
<br>
<b>Drill Down </b>: Exponer progresivamente m&#225;s detalle (dentro de un reporte o consulta), mediante selecciones de &#237;tems sucesivamente.
<br>
<b>Drill-Up </b>: Es el efecto contrario a drill -down. Significa ver menos nivel de detalle, sobre la jerarqu&#237;a significa generalizar o sumarizar, es decir, subir en el &#225;rbol jer&#225;rquico.
<br>

<br>
Mediante la selecci&#243;n de las jerarqu&#237;as disponibles (ya sea en drill down o drill up) para el reporte en cuesti&#243;n, BIC actualizar&#225; autom&#225;ticamente el reporte mostrando los datos seg&#250;n la funcionalidad elegida.
<br>

<br>
En la parte superior derecha se pueden ver los formatos disponibles para la exportaci&#243;n de los datos se muestran el centro de la pantalla. Estos formatos son: .xls (excel), .doc (word), .pdf (Adobe) y .txt (Notepad) en el mismo orden que se ven en la pantalla de izquierda a derecha.
<br>

<br>
En la parte inferior derecha podemos ver dos botones: <img src="clip0036.jpg" width="279" height="31" border="0" alt="clip0036">
<br>

<br>
<b>Ver SQL:</b>
<br>
Mediante esta opci&#243;n se accede a una ventana emergente, en la que se muestr&#225; la consulta de sql que dio lugar a los datos del reporte que se visualiza.
<br>

<br>
<p align="center"><img src="clip0037.jpg" width="772" height="454" border="0" alt="clip0037">
<br>
</p>
<br>
<b>Asistente de gr&#225;ficos:</b>
<br>
A menudo los listados con tanta informaci&#243;n resultan complejos de analizar e imaginar de manera global, es all&#237; donde surge la necesidad de una visi&#243;n integral que permita advertir elementos sensibles de ser estudiados. A trav&#233;s de su asistente de gr&#225;ficos BIC permite generar diferentes tipos de gr&#225;ficos acordes que se adaptan a las necesidades expuestas.
<br>

<br>
Mediante el bot&#243;n asistente de gr&#225;ficos se accede a una ventana emergente, en la cual una serie de pasos nos permite configurar el gr&#225;fico de acuerdo a los par&#225;metros que consideremos adecuados para el mismo.:
<br>
<u>
<br>
Paso 1.  Selecci&#243;n de tipo de gr&#225;fico:</u>
<br>
En primer lugar pasamos a elegir el/los tipo/s de gr&#225;ficos que pretendemos. 
<br>
Los tipos de gr&#225;ficos disponibles son:
<br>
<table width="100%" border="0" cellpadding="0" cellspacing="0"><tr valign="top"><td width="14"><span style="font-family:Calibri; font-size:12pt; color:#000000"><font face="Symbol" size="2" color="#000000">&#183;</font></span></td><td><span style="font-family:Calibri; font-size:12pt; color:#000000">Barras: nos muestra el gr&#225;fico como columnas horizontales.
&nbsp;<br>
</span></td></tr></table><table width="100%" border="0" cellpadding="0" cellspacing="0"><tr valign="top"><td width="14"><span style="font-family:Calibri; font-size:12pt; color:#000000"><font face="Symbol" size="2" color="#000000">&#183;</font></span></td><td><span style="font-family:Calibri; font-size:12pt; color:#000000">Columnas: muestran los datos como conjuntos de columnas verticales
&nbsp;<br>
</span></td></tr></table><table width="100%" border="0" cellpadding="0" cellspacing="0"><tr valign="top"><td width="14"><span style="font-family:Calibri; font-size:12pt; color:#000000"><font face="Symbol" size="2" color="#000000">&#183;</font></span></td><td><span style="font-family:Calibri; font-size:12pt; color:#000000">Torta: son gr&#225;ficos circulares que muestran los datos como porcentajes de un total.
&nbsp;<br>
</span></td></tr></table><table width="100%" border="0" cellpadding="0" cellspacing="0"><tr valign="top"><td width="14"><span style="font-family:Calibri; font-size:12pt; color:#000000"><font face="Symbol" size="2" color="#000000">&#183;</font></span></td><td><span style="font-family:Calibri; font-size:12pt; color:#000000">Area:  muestran los datos como un conjunto de puntos conectados por una l&#237;nea, con un &#225;rea rellenada debajo de la l&#237;nea.
&nbsp;<br>
</span></td></tr></table><table width="100%" border="0" cellpadding="0" cellspacing="0"><tr valign="top"><td width="14"><span style="font-family:Calibri; font-size:12pt; color:#000000"><font face="Symbol" size="2" color="#000000">&#183;</font></span></td><td><span style="font-family:Calibri; font-size:12pt; color:#000000">Lineas: muestran los datos como un conjunto de puntos conectados mediante una l&#237;nea.
&nbsp;<br>
</span></td></tr></table><table width="100%" border="0" cellpadding="0" cellspacing="0"><tr valign="top"><td><span style="font-family:Calibri; font-size:12pt; color:#000000"></span></td><td></td></tr></table><span style="font-family:Calibri; font-size:12pt; color:#000000">
<br>
<p align="center"><img src="clip0038.jpg" width="765" height="552" border="0" alt="clip0038">
<br>
</p>BIC nos permite seleccionar m&#225;s de dos tipos de gr&#225;ficos si estos son compatibles. Cuando seleccionmos un gr&#225;fico, se deshabilitan los que no son compatibles con el mismo. Asimismo si queremos deseleccionar un gr&#225;fico que hemos elegido anteriormente volvemos a hacer un click sobre el mismo.
<br>
Luego de elegir los gr&#225;ficos, presione el bot&#243;n siguiente para acceder al pr&#243;ximo paso.
<br>

<br>
<u>Paso 2: Configuraci&#243;n del orgien de datos:
<br>
</u>En este paso podemos configurar los siguientes campos:
<br>
<table width="100%" border="0" cellpadding="0" cellspacing="0"><tr valign="top"><td width="14"><span style="font-family:Calibri; font-size:12pt; color:#000000"><font face="Symbol" size="2" color="#000000">&#183;</font></span></span></span></td><td><span style="font-family:Calibri; font-size:12pt; color:#000000">Fuente de datos: mediante un combo se seleccionan las <a href=javaScript:parent.reDisplay('4.8',1,0)>metricas</a> que se desea que aparezcan el en gr&#225;fico a realizar.
&nbsp;<br>
</span></td></tr></table><table width="100%" border="0" cellpadding="0" cellspacing="0"><tr valign="top"><td width="14"><span style="font-family:Calibri; font-size:12pt; color:#000000"><font face="Symbol" size="2" color="#000000">&#183;</font></span></td><td><span style="font-family:Calibri; font-size:12pt; color:#000000">Fuente de descripciones: en este combo se selecciona el atributo que va a aparecer en la parte inferior del gr&#225;fico identificando a cada categor&#237;a del mismo.
&nbsp;<br>
</span></td></tr></table><table width="100%" border="0" cellpadding="0" cellspacing="0"><tr valign="top"><td width="14"><span style="font-family:Calibri; font-size:12pt; color:#000000"><font face="Symbol" size="2" color="#000000">&#183;</font></span></td><td><span style="font-family:Calibri; font-size:12pt; color:#000000">Alias del origen de datos: en este campo se pueden escribir en forma manual un nombre diferente del que muestra la fuente de datos. Este campo es opcional. En el caso de no escribir nada se pondr&#225; el mismo nombre que se puede observar en la fuente de datos.
&nbsp;<br>
</span></td></tr></table><table width="100%" border="0" cellpadding="0" cellspacing="0"><tr valign="top"><td width="14"><span style="font-family:Calibri; font-size:12pt; color:#000000"><font face="Symbol" size="2" color="#000000">&#183;</font></span></td><td><span style="font-family:Calibri; font-size:12pt; color:#000000">Origenes de datos: en esta lista se muestran las fuentes de datos que ya se han agregado para que aparezcan en el gr&#225;fico.
&nbsp;<br>
</span></td></tr></table><table width="100%" border="0" cellpadding="0" cellspacing="0"><tr valign="top"><td width="14"><span style="font-family:Calibri; font-size:12pt; color:#000000"><font face="Symbol" size="2" color="#000000">&#183;</font></span></td><td><span style="font-family:Calibri; font-size:12pt; color:#000000">Primeros: si esta seleccionado mostrar&#225; en el gr&#225;fico los primeros "x" registros que indica el campo que est&#225; ubicado a la derecha
&nbsp;<br>
</span></td></tr></table><table width="100%" border="0" cellpadding="0" cellspacing="0"><tr valign="top"><td width="14"><span style="font-family:Calibri; font-size:12pt; color:#000000"><font face="Symbol" size="2" color="#000000">&#183;</font></span></td><td><span style="font-family:Calibri; font-size:12pt; color:#000000">Ultimos: si esta seleccionado mostrar&#225; en el gr&#225;fico los ultimos "x" registros que indica el campo que est&#225; ubicado a la derecha
&nbsp;<br>
</span></td></tr></table><table width="100%" border="0" cellpadding="0" cellspacing="0"><tr valign="top"><td width="14"><span style="font-family:Calibri; font-size:12pt; color:#000000"><font face="Symbol" size="2" color="#000000">&#183;</font></span></td><td><span style="font-family:Calibri; font-size:12pt; color:#000000">Todos: si esta seleccionado mostrar&#225; en el gr&#225;fico absolutamente todos los registros del reporte.
&nbsp;<br>
</span></td></tr></table><table width="100%" border="0" cellpadding="0" cellspacing="0"><tr valign="top"><td><span style="font-family:Calibri; font-size:12pt; color:#000000"></span></td><td></td></tr></table><span style="font-family:Calibri; font-size:12pt; color:#000000">
<br>

<br>
<p align="center"><img src="clip0039.jpg" width="754" height="683" border="0" alt="clip0039">
<br>
</p>
<br>
En primer lugar se debe elegir el campo fuente de descripciones, para luego ir agregando a los origenes de datos las fuentes de datos correspondientes.
<br>
Cuando se agrega una fuente de datos se observa la pre-visualizaci&#243;n del gr&#225;fico que se va a mostrar luego.  
<br>
Por &#250;ltimo se tiene la opci&#243;n de filtrar la cantidad de registros que se desean ver en el gr&#225;fico, esto se logra seleccionando la opci&#243;n "primeros" o "&#250;ltimos" e indicando, en el campo correspondiente, la cantidad de registros a filtrar.
<br>
Luego de configurar los campos correspondientes, presione el bot&#243;n siguiente para ver finalizado el gr&#225;fico.
<br>

<br>
<u>Paso 3: Obtenci&#243;n del gr&#225;fico.</u>
<br>
En la figura siguiente se observa el gr&#225;fico finalizado. En la parte inferior del gr&#225;fico se presentan las referencias a los colores que se muestran en el mismo.
<br>
Adicionalmente existe la posibilidad de imprimir el gr&#225;fico a trav&#233;s del &#237;cono de impresora que se ve en la parte superior derecha.<u>
<br>

<br>

<br>
</u><p align="center"><img src="clip0040.jpg" width="762" height="611" border="0" alt="clip0040">
<br>
</p>
<br>

<br>
</span><span style="font-family:Helvetica,Arial; font-size:10pt; color:#000000">
<br>

<br>

<br>

<br>
<p align="center">
<br>
</span></span></span></p>

</body>
</html>
