<html>
<head>
   <title>Atributos</title>
   <meta name="generator" content="Help & Manual">
   <meta name="keywords" content="">
</head>


  <!-- Redirect browser to index page if page is not in the content frame.
       This script is only valid for regular HTML export -->
  <script language="JavaScript">
       <!--
           if(top.frames.length==0) top.location.href='index.html?atributos2.htm'
       //-->
  </script>


<body bgcolor="#FFFFFF">


<table width="100%" border="0" cellspacing="0" cellpadding="2" bgcolor="#C0C0C0">
  <tr>
    <td align="left">
      
<span style="font-family:Helvetica,Arial; font-size:12pt; color:#000000"><b>Atributos</b><span style="font-family:Helvetica,Arial; font-size:10pt; color:#000000">
<br>
</span></span></span>
    </td>
    <td align="right">
     <font face="Arial" size="2">
     <a href="javaScript:parent.reDisplay('1',1,0)">Arriba</a>&nbsp;
     <a href="javaScript:parent.reDisplay('4.4',1,0)">Abajo</a>&nbsp;
     <a href="javaScript:parent.reDisplay('4.6',1,0)">Siguiente</a>
     </font>
    </td>
  </tr>
</table>
<br>


<span style="font-family:Calibri; font-size:12pt; color:#000000">La administraci&#243;n de Atributos se realiza luego de haber iniciado la <a href=javaScript:parent.reDisplay('4.2',1,0)>sesi&oacute;n</a> en BIC y luego de haber seleccionado el <a href=javaScript:parent.reDisplay('4.3',1,0)>proyecto</a> deseado, all&#237; se presenta la pantalla de gesti&#243;n de proyectos, donde se debe seleccionar la solapa de atributos:<span style="font-family:Helvetica,Arial; font-size:10pt; color:#000000">
<br>

<br>
<p align="center"><img src="clip0017a.jpg" width="791" height="590" border="0" alt="clip0017a">
<br>
</p>
<br>
</span><span style="font-family:Calibri; font-size:14pt; color:#000000"><b><i><u>Agregar nuevo:
<br>
</u></i></b></span><span style="font-family:Calibri; font-size:12pt; color:#000000">Si se desea crear un nuevo atributo se presiona el bot&#243;n <img src="clip0013.jpg" width="111" height="21" border="0" alt="clip0013">, el cual podemos visualizar en la figura anterior. Luego de esto se mostrar&#225; la siguiente pantalla:
<br>

<br>
<p align="center"><img src="clip0016a.jpg" width="769" height="583" border="0" alt="clip0016a">
<br>

<br>
</p>A trav&#233;s de esta pantalla se pueden ingresar los campos Nombre, Tabla LookUp, Id, Descripciones e Hijo que corrresponden al nuevo atributo a crear.
<br>

<br>
El sistema corroborar&#225; si la informaci&#243;n sumistrada es correcta. Si se presiona el bot&#243;n <img src="clip0007.jpg" width="73" height="27" border="0" alt="clip0007"> no se crear&#225; el atributo y se volver&#225; a la pantalla de gesti&#243;n de atributos. Si presiona <img src="clip0008.jpg" width="68" height="28" border="0" alt="clip0008"> y las datos son correctos, se crear&#225; el atributo con los datos ingresados.
<br>

<br>
A continuaci&#243;n se describen cada uno de los campos que se deben llenar para poder crear un atributo:
<br>
<i>Nombre</i>: identificaci&#243;n &#250;nica con la cual se identificar&#225; al atributo dentro del proyecto.
<br>
<i>Tabla LookUp</i><i>:</i> es la tabla del modelo (la cual se defini&#243; en la solapa Tablas) a la cual el atributo a crear hace referencia.
<br>
<i>Id</i><i>:</i><i> </i>es el identificador de la tabla lookUp con el que se quiere vincular al atributo<i>
<br>
Descripci&#243;n</i>: se seleccionan las descripciones del atributo que se mostrar&#225;n en el reporte (pueden ser m&#225;s de uno).
<br>
<i>Hijo</i>: crea una relaci&#243;n con una Tabla (de las posibles, que se presentan en el combo).
<br>
</span><span style="font-family:Calibri; font-size:14pt; color:#000000"><b><i><u>
<br>
Editar:</u></i></b></span><span style="font-family:Calibri; font-size:12pt; color:#000000">
<br>
Si se desea modificar un atributo en especial se presiona el "editar" correspondiente al atributo a editar. Luego de esto se mostrar&#225; la siguiente pantalla:
<br>

<br>
<p align="center"><img src="clip0018a.jpg" width="777" height="582" border="0" alt="clip0018a">
<br>

<br>
</p>A trav&#233;s de esta pantalla se puede cambiar los campos Nombre, Tabla LookUp, Id, Descripciones e Hijo. 
<br>
El sistema corroborar&#225; si la informaci&#243;n sumistrada es correcta. 
<br>
Si se presiona el bot&#243;n <img src="clip0007.jpg" width="73" height="27" border="0" alt="clip0007"> no se har&#225; ning&#250;n cambio y se volver&#225; a la pantalla de gesti&#243;n de atributos. Si presiona <img src="clip0008.jpg" width="68" height="28" border="0" alt="clip0008"> y las datos son correctos, se efectuar&#225;n las modificaciones ingresadas.
<br>

<br>
</span><span style="font-family:Calibri; font-size:14pt; color:#000000"><b><i><u>Borrar:</u></i></b></span><span style="font-family:Calibri; font-size:12pt; color:#000000">
<br>
Si se desea borrar un atributo en especial se presiona el "borrar" correspondiente al atributo a eliminar. 
<br>
Si el atributo esta siendo usado por alg&#250;n <a href=javaScript:parent.reDisplay('4.7',1,0)>filtro</a> o <a href=javaScript:parent.reDisplay('4.9',1,0)>reporte</a>, un mensaje har&#225; tal advertencia y no ser&#225; posible la eliminaci&#243;n.
<br>
Si el atributo puede ser eliminado, se desplegar&#225; el siguiente mensaje:
<br>

<br>
<p align="center"><img src="clip0019a.jpg" width="290" height="133" border="0" alt="clip0019a">
<br>
</p>
<br>
Si luego de esta advertencia se presiona el bot&#243;n <img src="clip0010.jpg" width="70" height="17" border="0" alt="clip0010"> quedar&#225; elimanado el atributo del sistema.
<br>

<br>
En cualquier caso anterior si se presiona el bot&#243;n <img src="clip0012.jpg" width="70" height="18" border="0" alt="clip0012"> el atributo quedar&#225; en el sistema tal cual como estaba antes de intentar eliminarlo.
<br>

<br>
Una vez configurados los atributos, podr&#225;n ser usados en los <a href=javaScript:parent.reDisplay('4.7',1,0)>filtros</a> y <a href=javaScript:parent.reDisplay('4.9',1,0)>reportes</a>.</span><span style="font-family:Helvetica,Arial; font-size:10pt; color:#000000">
<br>
</span></span></span>

</body>
</html>
