<html>
<head>
   <title>Proyectos</title>
   <meta name="generator" content="Help & Manual">
   <meta name="keywords" content="">
</head>


  <!-- Redirect browser to index page if page is not in the content frame.
       This script is only valid for regular HTML export -->
  <script language="JavaScript">
       <!--
           if(top.frames.length==0) top.location.href='index.html?proyecto.htm'
       //-->
  </script>


<body bgcolor="#FFFFFF">


<table width="100%" border="0" cellspacing="0" cellpadding="2" bgcolor="#C0C0C0">
  <tr>
    <td align="left">
      
<span style="font-family:Helvetica,Arial; font-size:12pt; color:#000000"><b>Proyectos
<br>
</b></span>
    </td>
    <td align="right">
     <font face="Arial" size="2">
     <a href="javaScript:parent.reDisplay('1',1,0)">Arriba</a>&nbsp;
     <a href="javaScript:parent.reDisplay('1.1.1',1,0)">Abajo</a>&nbsp;
     <a href="javaScript:parent.reDisplay('1.1.3',1,0)">Siguiente</a>
     </font>
    </td>
  </tr>
</table>
<br>


<span style="font-family:Calibri; font-size:12pt; color:#000000">Un <b><i>proyecto</i></b> representa un DataMart, es decir, un almac&#233;n de datos hist&#243;ricos relativos a un departamento de la organizaci&#243;n. Por lo tanto un <b><i>proyecto</i></b> (DataMart) puede ser simplemente una copia de parte de un DataWarehouse para uso departamental.
<br>

<br>
En el m&#243;dulo de gesti&#243;n de proyectos se puede crear, modificar o borrar un <b><i>proyecto</i></b>. El <a href=javaScript:parent.reDisplay('3.1',1,0)>reportero</a> tiene a disposici&#243;n el listado de todos los proyectos que ha creado el arquitecto.
<br>

<br>
Para que el reportero obtenga el beneficio de gestionar los proyectos, el arquitecto deber&#225; configurar los <a href=javaScript:parent.reDisplay('1.1.4',1,0)>atributos</a>, <a href=javaScript:parent.reDisplay('1.1.7',1,0)>m&eacute;tricas</a>, <a href=javaScript:parent.reDisplay('1.1.6',1,0)></a>, <a href=javaScript:parent.reDisplay('1.1.5',1,0)>hechos</a> y <a href=javaScript:parent.reDisplay('1.1.3',1,0)></a> del proyecto en cuesti&#243;n.
<br>

<br>
Usualmente las empresas tienen un proyecto asignado a cada &#225;rea de la organizaci&#243;n, ya que cada una de est&#225;s tiene su propia informaci&#243;n como as&#237; tambi&#233;n sus objetos de negocios particulares. No obstante se puede tener agrupado en solo un proyecto m&#225;s de un &#225;rea de la empresa, esto depende de como sean los flujos de informaci&#243;n y la din&#225;mica en la misma.
<br>

<br>
La gesti&#243;n del proyecto es el primer paso para el objetivo del sistema: poder brindarle al tomador de decisiones de cualquier corporaci&#243;n una herramienta m&#225;s con la cual poder guiar sus metas y objetivos a mediano y largo plazo.<span style="font-family:Helvetica,Arial; font-size:10pt; color:#000000">
<br>
</span></span></span>

</body>
</html>
